clear;
clc;
x=[0 1 1 4 7 7 8 8 7 4 1 0 0;
0 0 6 0 6 0 0 8 8 2 8 8 0;
1 1 1 1 1 1 1 1 1 1 1 1 1];

% 각도별로 변화하는 for문
for s=0:5:1080
    th=s*pi/180;

    %크기 변화
    a= s/1080*0.9+0.1;
    E= [a 0 0; 0 a 0; 0 0 a];
    r= E*x;

    %회전 변화
    F=[cos(th) sin(th) 0; -sin(th) cos(th) 0; 0 0 1];
    r=F*r;

    %평행 이동
    G=[1 0 th*cos(th); 0 1 th*sin(th); 0 0 1];
    r=G*r;
   
    %제목 및 line 그리기
    clf;
    title('임베디드시스템공학과 202201676 장경은')
    axis([-30 30 -30 30]);
    line(r(1,:),r(2,:));
    
    %동영상
    pause(0.000001);
end



